{"中国植物志":"土生，主茎先直立而后攀援状，长50-100厘米或更长，无横走地下茎。根托只生于主茎的下部或沿主茎断续着生，自主茎分叉处下方生出，长3-10厘米，直径0.1-0.5毫米，根少分叉，被毛。主茎自近基部羽状分枝，不呈“之”字形，无关节，禾秆色，主茎下部直径1-1.5毫米，茎圆柱状，具沟槽，无毛，维管束1条，主茎顶端不呈黑褐色，主茎先端鞭形，侧枝5-8对，2回羽状分枝，小枝排列紧密，主茎上相邻分枝相距5-8厘米，分枝无毛，背腹压扁，末回分枝连叶宽3.8-6毫米。叶全部交互排列，二形，草质，表面光滑，具虹彩，边缘全缘，明显具白边，主茎上的叶排列较疏，较分之上的大，二形，绿色。主茎上的腋叶明显大于分枝上的，肾形，或略心形，3毫米×4毫米，分枝上的腋叶对称，宽椭圆形或心形，2.2-2.8毫米×0.8-2.2毫米，边缘全缘，基部不呈耳状，近心形。中叶不对称，主茎上的明显大于侧枝上的，侧枝上的叶卵圆形，1.0-2.4毫米×0.6-1.0毫米，接近到覆瓦状排列，背部不呈龙骨状，先端与轴平行或交叉或常向后弯，长渐尖，基部钝，边缘全缘。侧叶不对称，主茎上的明显大于侧枝上的，分枝上的长圆形，外展，紧接，2.2-3.2毫米× 1.0-1.6毫米，先端急尖或具短尖头，边缘全缘，上侧基部不扩大，不覆盖小枝，上侧边缘全缘，下侧基部圆形，下侧边缘全缘。孢子叶穗紧密，四棱柱形，单生于小枝末端，5.0-25毫米×2.5-4.0毫米；孢子叶一形，卵状三角形，边缘全缘，具白边，先端渐尖，龙骨状；大孢子叶分布于孢子叶穗下部的下侧或中部的下侧或上部的下侧。大孢子灰白色或暗褐色；小孢子淡黄色。","中国高等植物":"土生，主茎先直立后攀援状，长0.5-1米或更长，无横走地下茎。根托生于主茎下部或沿主茎断续着生，自主茎分叉处下方生出，长3-10厘米，径0.1-0.5毫米，根少分叉，被毛。主茎近基部羽状分枝，禾秆色，主茎下部径1-1.5毫米,茎圆柱状，具沟槽，无毛，维管束1条，主茎顶端不呈黑褐色，主茎先端鞭形，侧枝5-8对，二回羽状分枝，小枝排列紧密，主茎上分枝相距5-8厘米，分枝无毛，背腹扁，末回分枝连叶宽3.8-6毫米。叶交互排列，二型，草质，光滑，具虹彩，全缘，具白边，主茎的叶较疏，二型，绿色；主茎的腋叶大于分枝的，肾形，或略心形，长3毫米，分枝上的腋叶对称，宽椭圆形或心形，长2.2-2.8毫米，边缘全缘，基部不呈耳状，近心形；中叶不对称，主茎的大于侧枝的，侧枝的卵圆形，长1-2.4毫米，接近或覆瓦状排列，先端与轴平行或交叉或后弯，te渐尖，基部钝，全缘；侧叶不对称，主茎的大于侧枝的，分枝的长圆形，外展，紧接，长2.2-3.2毫米，先端尖或具短尖头，全缘，上侧基部不覆盖小枝，上侧全缘，下侧基部圆，下侧全缘。孢子叶穗紧密，四棱柱形，单生于小枝末端，长0.5-2.5厘米：孢子叶一型，卵状三角形，全缘，具白边，先端渐尖，龙骨状；大孢子叶分布于孢子叶穗下部的下侧或中部的下侧或上部的下侧。大孢子灰白或暗褐色；小孢子淡黄色。","中国高等植物图鉴":"    主茎伏地蔓生，长30-60厘米，禾秆色，有棱，分枝处常生不定根，叶卵形，短尖头，二列疏生；侧枝通常疏生，多回分叉，基部有不定根；营养叶二形，背腹各二列，腹叶（中叶）长卵形，渐尖头，全缘，交互疏生，背叶矩圆形，短尖头，全缘，向两侧平展。孢子囊穗四棱形；孢子叶卵状三角形，龙骨状，长渐尖头，全缘，四列，覆瓦状排列，孢子囊卵形。抱孢二形。    分布于浙江、福建、台湾、广东、广西、贵州、云南、四川和湖南。生林下湿石上或石洞内，海拔40-1000米。全草人药，有清热解毒、去湿、利尿、消炎、止血之效。","形态特征":{"叶":"叶交互排列，二型，草质，光滑，具虹彩，全缘，具白边，主茎的叶较疏，二型，绿色；主茎的腋叶大于分枝的，肾形，或略心形，长3毫米，分枝上的腋叶对称，宽椭圆形或心形，长2.2-2.8毫米，边缘全缘，基部不呈耳状，近心形；中叶不对称，主茎的大于侧枝的，侧枝的卵圆形，长1-2.4毫米，接近或覆瓦状排列，先端与轴平行或交叉或后弯，te渐尖，基部钝，全缘；侧叶不对称，主茎的大于侧枝的，分枝的长圆形，外展，紧接，长2.2-3.2毫米，先端尖或具短尖头，全缘，上侧基部不覆盖小枝，上侧全缘，下侧基部圆，下侧全缘。","果":"孢子叶穗紧密，四棱柱形，单生于小枝末端，长0.5-2.5厘米：孢子叶一型，卵状三角形，全缘，具白边，先端渐尖，龙骨状；大孢子叶分布于孢子叶穗下部的下侧或中部的下侧或上部的下侧。","枝":"no","染色体":"no","株":"土生，主茎先直立后攀援状，长0.5-1米或更长，无横走地下茎。","根":"根托生于主茎下部或沿主茎断续着生，自主茎分叉处下方生出，长3-10厘米，径0.1-0.5毫米，根少分叉，被毛。","花":"no","花果期":"no","茎":"主茎近基部羽状分枝，禾秆色，主茎下部径1-1.5毫米,茎圆柱状，具沟槽，无毛，维管束1条，主茎顶端不呈黑褐色，主茎先端鞭形，侧枝5-8对，二回羽状分枝，小枝排列紧密，主茎上分枝相距5-8厘米，分枝无毛，背腹扁，末回分枝连叶宽3.8-6毫米。"}}